tap "chaindead/tap"
tap "charmbracelet/tap"
tap "gromgit/brewtils"
tap "homebrew/bundle"
tap "homebrew/services"
tap "homeport/tap"
tap "jordond/tap"
tap "kfastov/tap"
tap "marcus/tap"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "raine/workmux"
tap "schpet/tap"
tap "sikarugir-app/sikarugir"
tap "steipete/tap"
tap "steveyegge/beads"
tap "stripe/stripe-cli"
tap "typester/yashiki"
tap "withgraphite/tap"
tap "xo/xo"
tap "yakitrak/yakitrak"
# Fast, lightweight CLI for App Store Connect
brew "asc"
# Code searching, linting, rewriting
brew "ast-grep"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Toolchain of the web
brew "biome"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Emacs dependency management
brew "cask"
# CLI tool for analyzing Claude Code usage from local JSONL files
brew "ccusage"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Load/unload environment variables based on $PWD
brew "direnv"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Easiest way to build and release mobile apps
brew "fastlane"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Audio codec
brew "opus"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Play, record, convert, and stream many audio and video codecs
brew "ffmpeg-full"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Git LFS plugin that uploads and downloads using the Xet protocol
brew "git-xet"
# Tool for glamorous shell scripts
brew "gum"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Get events and tasks from the macOS calendar database
brew "ical-buddy"
# Tools and libraries to manipulate images in many formats
brew "imagemagick-full"
# CLI for Infisical
brew "infisical"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Simple terminal UI for git commands
brew "lazygit"
# Apple Silicon Monitor Top written in Go Lang
brew "mactop"
# Mac App Store command-line interface
brew "mas"
# Open source relational database management system
brew "mysql"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Fast, disk space efficient package manager
brew "pnpm"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@16"
# Ultra-fast CSV data-wrangling toolkit
brew "qsv"
# SVG rendering tool and library
brew "resvg"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# CLI proxy to minimize LLM token consumption
brew "rtk"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Fast, configurable, shell plugin manager
brew "sheldon"
# Cross-shell prompt for astronauts
brew "starship"
# Multi-modal AI tool to extract and summarize content
brew "summarize"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# CLI for Git worktree management, designed for parallel AI agent workflows
brew "worktrunk"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Telegram MCP server for AI assistants
brew "chaindead/tap/telegram-mcp"
# Interactive TUI for Homebrew
brew "gromgit/brewtils/taproom"
# Creates screenshots based on terminal command output.
brew "homeport/tap/termshot"
# Terminal-based battery and energy monitor for macos and linux
brew "jordond/tap/jolt"
# Telegram CLI + MCP server
brew "kfastov/tap/tgcli"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Opinionated workflow tool that orchestrates git worktrees and tmux
brew "raine/workmux/workmux"
# CLI tool for linear.app that uses git branch names and directory names to open issues and team pages
brew "schpet/tap/linear"
# Fast X CLI for tweeting, replying, and reading
brew "steipete/tap/bird"
# Google CLI for Gmail, Calendar, Drive, Docs, Sheets, and more
brew "steipete/tap/gogcli"
# Modern Go client + CLI for the Google Places API (New)
brew "steipete/tap/goplaces"
# Lightning-fast macOS screenshots & AI vision analysis
brew "steipete/tap/peekaboo"
# Fast CLI for Apple Reminders
brew "steipete/tap/remindctl"
# Command-line ElevenLabs TTS with mac-style flags
brew "steipete/tap/sag"
# AI-supervised issue tracker for coding workflows
brew "steveyegge/beads/bd"
# Stripe CLI utility
brew "stripe/stripe-cli/stripe"
# Allows you to manage your stacked changes and submit them for review on GitHub
brew "withgraphite/tap/graphite"
# universal command-line SQL client interface
brew "xo/xo/usql"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Chromium based browser
cask "arc"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Menu bar usage monitor for Codex and Claude
cask "steipete/tap/codexbar"
# Write, edit, and chat about your code with AI
cask "cursor"
cask "font-symbols-only-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Graphically shows disk usage within a file system
cask "grandperspective"
# Free and open-source media player
cask "iina"
# Menu bar manager
cask "jordanbaird-ice"
# App to manage software development and track bugs
cask "linear"
# App to write, plan, collaborate, and get organised
cask "notion"
# Calendar for professionals and teams
cask "notion-calendar"
# Replacement for Docker Desktop
cask "orbstack"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Control your tools with a few keystrokes
cask "raycast"
# Porting tool, to make Windows programs/games into native apps
cask "sikarugir-app/sikarugir/sikarugir"
# System monitor for the menu bar
cask "stats"
# Native desktop client for WhatsApp
cask "whatsapp"
# Menu bar Wi-Fi monitor and diagnostics app
cask "whyfi"
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Backtrack", id: 1477089520
mas "CmdList", id: 6747479815
mas "CrystalFetch", id: 6454431289
mas "GarageBand", id: 682658836
mas "HP", id: 1474276998
mas "Image2Icon", id: 992115977
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Paper VPN", id: 6460976587
mas "Prime Video", id: 545519333
mas "Tailscale", id: 1475387142
mas "Telegram", id: 747648890
mas "TestFlight", id: 899247664
mas "Xcode", id: 497799835
go "github.com/steveyegge/gastown/cmd/gt"
cargo "tauri-cli"
uv "twitter-cli"
